# **GroupBy Operations**

## **Understanding the GroupBy**

In [2]:
import pandas as pd

In [5]:
titanic = pd.read_csv('titanic.csv')

In [6]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [7]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [8]:
titanic.tail()

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [20]:
titanic_slice = titanic.iloc[:10, [2,3]]

In [21]:
titanic_slice

      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0
5    male   NaN
6    male  54.0
7    male   2.0
8  female  27.0
9  female  14.0

In [22]:
titanic_slice.groupby(by = 'sex')

In [23]:
gbo = titanic_slice.groupby(by = 'sex')

In [30]:
type(gbo)

pandas.core.groupby.generic.DataFrameGroupBy

In [27]:
gbo.groups

{'female': [1, 2, 3, 8, 9], 'male': [0, 4, 5, 6, 7]}

In [31]:
gbo_l = list(gbo)

In [33]:
gbo_l[0]

('female',
       sex   age
 1  female  38.0
 2  female  26.0
 3  female  35.0
 8  female  27.0
 9  female  14.0)

In [35]:
type(gbo_l[0])

tuple

In [36]:
gbo_l[0][0]

'female'

In [37]:
gbo_l[0][1]

      sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0

In [45]:
type(gbo_l[0][1])

pandas.core.frame.DataFrame

In [51]:
gbo_l[1][1]

    sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0

#### **Another approach for achieving the same result**

In [46]:
titanic_slice_f = titanic_slice.loc[titanic_slice.sex == 'female']

In [47]:
titanic_slice_f

      sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0

In [48]:
titanic_slice_m = titanic_slice.loc[titanic_slice.sex == 'male']

In [49]:
titanic_slice_m

    sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0

In [52]:
titanic_slice_m.equals(gbo_l[1][1])

True

In [54]:
for element in gbo:
    print(element)

('female',       sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0)
('male',     sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0)